tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "evanwieland/brute"
tap "gromgit/fuse"
tap "homebrew/cask"
tap "homebrew/core"
tap "koekeishiya/formulae"
tap "meegle84/tap"
tap "owo-network/brew"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Macro processing language
brew "m4"
# Text processing scripting language
brew "awk"
# Text-based UI library
brew "ncurses"
# Library for command-line editing
brew "readline"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Like cat but displays content with syntax highlighting
brew "ccat"
# GNU compiler collection
brew "gcc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# Wrapper around make to colorize the output
brew "colormake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Duplicate file utility
brew "czkawka"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# GNU data recovery tool
brew "ddrescue"
# Display graphs and colors of file system space/usage
brew "dfc"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# .NET Core
brew "dotnet@8"
# Generate documentation for several programming languages
brew "doxygen"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Cross-platform library for audio I/O
brew "portaudio"
# Text to speech, software speech synthesizer
brew "espeak"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Read-only implementation of ext4 for FUSE
brew "ext4fuse"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line tool for generating regular expressions
brew "grex"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Featureful UNIX password cracker
brew "john"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Portable library for network traffic capture
brew "libpcap"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Man-page inspired Markdown viewer
brew "mandown"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Powerful paging program
brew "most"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Graphical client for the Soulseek peer-to-peer network
brew "nicotine-plus"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Bash completion for Pip
brew "pip-completion"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Safe, concurrent, practical language
brew "rust"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Spoof your MAC address in macOS
brew "spoof-mac"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Display images in a terminal using block graphic characters
brew "terminalimageviewer"
# Powerful free data recovery utility
brew "testdisk"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# XML command-line utilities
brew "xmlstarlet"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
brew "beeftornado/rmtree/brew-rmtree"
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac"
# DeepLX is a permanently free DeepL API client written in Golang.
brew "owo-network/brew/deeplx"
# Batch file renaming utility
cask "advanced-renamer"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Private desktop AI chat application
cask "anythingllm"
# Application uninstaller
cask "appcleaner"
# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Download high quality artwork for movies, music albums, and more
cask "coverload"
# Tool to run Windows software
cask "crossover"
# Write, edit, and chat about your code with AI
cask "cursor"
# Modular audio player
cask "deadbeef-nightly"
# Voice and text chat software
cask "discord"
# Data recovery software
cask "disk-drill"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Finds duplicate files in a computer system
cask "dupeguru"
# Launcher for *Epic Games* games
cask "epic-games"
# Utility to finds and fix problems on computer systems
cask "etrecheckpro"
# Desktop wallet for cryptocurrency assets
cask "exodus"
# Web browser
cask "firefox"
# Flip clock screensaver
cask "fliqlo"
cask "font-roboto-mono-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Game development engine
cask "godot"
# C# scripting capable version of Godot game engine
cask "godot-mono"
# Game client
cask "gog-galaxy"
# Run LLMs locally
cask "gpt4all"
# Set which graphics card to use
cask "gswitch"
# Open-source video transcoder
cask "handbrake-app"
# iOS device backup software and file manager
cask "iexplorer"
# Vector graphics editor
cask "inkscape"
# Menu bar calendar
cask "itsycal"
# Offline AI chat tool
cask "jan"
# Download manager
cask "jdownloader"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# File system integration
cask "macfuse"
# Detailed information on every Apple product ever made
cask "mactracker"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Sandbox construction video game
cask "minecraft"
# Open-source DJ software
cask "mixxx"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Music tagger
cask "musicbrainz-picard"
# WiFi site survey software and WiFi scanner
cask "netspot"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Get up and running with large language models locally
cask "ollama-app"
# Interact with Ollama models
cask "ollamac"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# Origami crease pattern editor and folding simulator (fork of Orihime)
cask "oriedita"
# ORIPA is a drawing software dedicated to designing the crease patterns of origami. The unique feature of ORIPA is calculation of the folded shape from the pattern.
cask "oripa"
# Visual programming language for multimedia
cask "pd"
# Home media player
cask "plex"
# Graphical user interface for the 'defaults' command
cask "prefs-editor"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# List out the contents of a zip file in the QuickLook preview
cask "qlzipinfo"
# IDE for application development
cask "qt-creator"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Binary newsreader
cask "sabnzbd"
# PDF reader and note-taking application
cask "skim"
# File sharing network
cask "soulseek"
# Sound and audio controller
cask "soundsource"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Quicklook extension for source files
cask "syntax-highlight"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# SSH client
cask "termius"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Web browser focusing on security
cask "tor-browser"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Yet another monitor
cask "yam-display"
mas "Amphetamine", id: 937984704
mas "FLIX IPTV", id: 1524212825
mas "MEGAVPN", id: 6456784858
mas "QuickShade", id: 931571202
mas "ScreenDimmer", id: 562058942
mas "WireGuard", id: 1451685025
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bmalehorn.shell-syntax"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "docker.docker"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "orepor.color-tabs-vscode-ext"
vscode "redhat.vscode-yaml"
vscode "rimuruchan.vscode-fix-checksums-next"
vscode "tonka3000.qtvsctools"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zachflower.uncrustify"
