tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jhawthorn/fzy"
tap "koekeishiya/formulae"
tap "mikhailai/misc"
# Text processing scripting language
brew "awk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# Wrapper around make to colorize the output
brew "colormake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# GNU data recovery tool
brew "ddrescue"
# Display graphs and colors of file system space/usage
brew "dfc"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Read-only implementation of ext4 for FUSE
brew "ext4fuse"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line tool for generating regular expressions
brew "grex"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Utils for conversion of cap/pcap/pcapng WiFi dump files
brew "hcxtools"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Macro processing language
brew "m4"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Portable library for network traffic capture
brew "libpcap"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Man-page inspired Markdown viewer
brew "mandown"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Powerful paging program
brew "most"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Bash completion for Pip
brew "pip-completion"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Monitor data's progress through a pipe
brew "pv"
# Safe, concurrent, practical language
brew "rust"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Spoof your MAC address in macOS
brew "spoof-mac"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Display images in a terminal using block graphic characters
brew "terminalimageviewer"
# Powerful free data recovery utility
brew "testdisk"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# List detailed info about USB devices
brew "usbutils"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
brew "beeftornado/rmtree/brew-rmtree"
# Professional graphic design software
cask "affinity-designer1"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Download high quality artwork for movies, music albums, and more
cask "coverload"
# Tool to run Windows software
cask "crossover"
# Modular audio player
cask "deadbeef-nightly"
# Voice and text chat software
cask "discord"
# Data recovery software
cask "disk-drill"
# Developer platform
cask "dotnet-sdk"
# Utility to finds and fix problems on computer systems
cask "etrecheckpro"
# Desktop wallet for cryptocurrency assets
cask "exodus"
# Screenshot software
cask "flameshot"
# Flip clock screensaver
cask "fliqlo"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Game development engine
cask "godot"
# C# scripting capable version of Godot game engine
cask "godot-mono"
# Set which graphics card to use
cask "gswitch"
# Open-source video transcoder
cask "handbrake"
# iOS device backup software and file manager
cask "iexplorer"
# Menu bar calendar
cask "itsycal"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Discover, download, and run local LLMs
cask "lm-studio"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# File system integration
cask "macfuse"
# Detailed information on every Apple product ever made
cask "mactracker"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Open-source DJ software
cask "mixxx"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Music tagger
cask "musicbrainz-picard"
# WiFi site survey software and WiFi scanner
cask "netspot"
# Keeps current IP address in sync
cask "no-ip-duc"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# Visual programming language for multimedia
cask "pd"
# Graphical user interface for the 'defaults' command
cask "prefs-editor"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# IDE for application development
cask "qt-creator"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# File sharing network
cask "soulseek"
# Sound and audio controller
cask "soundsource"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# SSH client
cask "termius"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Web browser focusing on security
cask "tor-browser"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Yet another monitor
cask "yam-display"
mas "Amphetamine", id: 937984704
mas "FLIX IPTV", id: 1524212825
mas "QuickShade", id: 931571202
mas "screendimmer", id: 562058942
mas "WireGuard", id: 1451685025
vscode "bmalehorn.shell-syntax"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "mhutchie.git-graph"
vscode "mondersky.tabscolor"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "orepor.color-tabs-vscode-ext"
vscode "tonka3000.qtvsctools"
vscode "twxs.cmake"
vscode "zachflower.uncrustify"
