tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jhawthorn/fzy"
tap "koekeishiya/formulae"
tap "mikhailai/misc"
# Search tool like grep, but optimized for programmers
brew "ack"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Text processing scripting language
brew "awk"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Change macOS display brightness from the command-line
brew "brightness"
# Manage compile and link flags for libraries
brew "pkg-config"
# New way to see and navigate directory trees
brew "broot"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# Wrapper around make to colorize the output
brew "colormake"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Display graphs and colors of file system space/usage
brew "dfc"
# File comparison utilities
brew "diffutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Classic UNIX line editor
brew "ed"
# Emoji on the command-line :scream:
brew "emojify"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Simple file manager written in bash
brew "fff"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Alternative to top/htop
brew "glances"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image processing tools collection
brew "graphicsmagick"
# Command-line tool for generating regular expressions
brew "grex"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive environments for writing and running code
brew "jupyterlab"
# Pager program similar to more
brew "less"
# Next-gen compiler infrastructure
brew "llvm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Man-page inspired Markdown viewer
brew "mandown"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Powerful paging program
brew "most"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Cross-platform application and UI framework
brew "qt@5", link: true
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Simplistic interactive filtering tool
brew "peco"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Bash completion for Pip
brew "pip-completion"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Professional collaborative platform for embedded development
brew "platformio"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Monitor data's progress through a pipe
brew "pv"
# CPU/RAM/battery stats chart bar for tmux (and GNU screen)
brew "rainbarf"
# Reads and randomize lines from a file (or STDIN)
brew "randomize-lines"
# File browser
brew "ranger"
# Tool for shell commands execution, visualization and alerting
brew "sampler"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Display images in a terminal using block graphic characters
brew "terminalimageviewer"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# List detailed info about USB devices
brew "usbutils"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Add progress bars to command-line applications
brew "vramsteg"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Format XML documents
brew "xmlformat"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# Professional graphic design software
cask "affinity-designer"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"
# Electronics prototyping platform
cask "arduino"
# Text editor
cask "atom"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cryptocurrency exchange
cask "binance"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# C and C++ IDE
cask "clion"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Download high quality artwork for movies, music albums, and more
cask "coverload"
# Tool to run Windows software
cask "crossover"
# Voice and text chat software
cask "discord"
# Tool to hide status bar icons
cask "dozer"
# Utility to finds and fix problems on computer systems
cask "etrecheckpro"
# Desktop wallet for cryptocurrency assets
cask "exodus"
# Web browser
cask "firefox"
# Screenshot software
cask "flameshot"
# Flip clock screensaver
cask "fliqlo"
cask "font-roboto-mono-nerd-font"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Free and open-source image editor
cask "gimp"
# Desktop app for learning Git and GitHub
cask "git-it"
# Git client focusing on productivity
cask "gitkraken"
# Game client
cask "gog-galaxy"
# Virtual globe
cask "google-earth-pro"
# Set which graphics card to use
cask "gswitch"
# Open-source video transcoder
cask "handbrake"
# Tool to access information from available hardware sensors
cask "hwsensors"
# iOS device backup software and file manager
cask "iexplorer"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# File archiver
cask "keka"
# Office suite
cask "libreoffice"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Detailed information on every Apple product ever made
cask "mactracker"
# Syncs files between computers and MEGA Cloud drives
cask "megasync"
# Open-source DJ software
cask "mixxx"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Music tagger
cask "musicbrainz-picard"
# WiFi site survey software and WiFi scanner
cask "netspot"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Finder Toolbar app to open the current directory in Editor
cask "openineditor-lite"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# Visual programming language for multimedia
cask "pd"
# Allows installation and use of software designed for Windows
cask "playonmac"
# IDE for professional Python development
cask "pycharm"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
# IDE for application development
cask "qt-creator"
cask "quicknfo"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# PDF reader and note-taking application
cask "skim"
# Video chat, voice call and instant messaging application
cask "skype"
# File sharing network
cask "soulseek"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# To-do list and time tracker
cask "superproductivity"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Web browser focusing on security
cask "tor-browser"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# USB serial driver
cask "wch-ch34x-usb-serial-driver"
# Desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
mas "screendimmer", id: 562058942
mas "Xcode", id: 497799835
