tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Search tool like grep, but optimized for programmers
brew "ack"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Text processing scripting language
brew "awk"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Install pip packages as homebrew formulae
brew "brew-pip"
# Change macOS display brightness from the command-line
brew "brightness"
# New way to see and navigate directory trees
brew "broot"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Emacs dependency management
brew "cask"
# Like cat but displays content with syntax highlighting
brew "ccat"
# Console Matrix
brew "cmatrix"
# Color-highlighted diff(1) output
brew "colordiff"
# Wrapper around make to colorize the output
brew "colormake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Display graphs and colors of file system space/usage
brew "dfc"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Emoji on the command-line :scream:
brew "emojify"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Emoji guide for your commit messages
brew "gitmoji"
# Image processing tools collection
brew "graphicsmagick"
# ASCII-art displaying typo-corrector for commands
brew "gti"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive environments for writing and running code
brew "jupyterlab"
# Pager program similar to more
brew "less"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Powerful paging program
brew "most"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Development kit for the Java programming language
brew "openjdk"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Simplistic interactive filtering tool
brew "peco"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Bash completion for Pip
brew "pip-completion"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Monitor data's progress through a pipe
brew "pv"
# CPU/RAM/battery stats chart bar for tmux (and GNU screen)
brew "rainbarf"
# Reads and randomize lines from a file (or STDIN)
brew "randomize-lines"
# File browser
brew "ranger"
# SMART hard drive monitoring
brew "smartmontools"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Add progress bars to command-line applications
brew "vramsteg"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Format XML documents
brew "xmlformat"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
cask "alacritty"
cask "appcleaner"
cask "applepi-baker"
cask "arduino"
cask "atom"
cask "bettertouchtool"
cask "binance"
cask "brave-browser"
cask "cheatsheet"
cask "cleanmymac"
cask "coconutbattery"
cask "crossover"
cask "discord"
cask "dozer"
cask "dropbox"
cask "exodus"
cask "firefox"
cask "gemini"
cask "gimp"
cask "git-it"
cask "gitkraken"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-earth-pro"
cask "handbrake"
cask "hwsensors"
cask "iexplorer"
cask "inkscape"
cask "iterm2"
cask "itsycal"
cask "keka"
cask "libreoffice"
cask "mactracker"
cask "megasync"
cask "mounty"
cask "netspot"
cask "nordvpn"
cask "obs"
cask "onyx"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "pycharm"
cask "qbittorrent"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicknfo"
cask "rectangle"
cask "soulseek"
cask "spotify"
cask "steam"
cask "superproductivity"
cask "teamviewer"
cask "telegram-desktop"
cask "tg-pro"
cask "tor-browser"
cask "unetbootin"
cask "virtualbox"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
cask "zoom"
mas "Apple Configurator 2", id: 1037126344
mas "Duplicate Photos Finder", id: 984929789
mas "MindNode", id: 1289197285
mas "screendimmer", id: 562058942
mas "Xcode", id: 497799835
